glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM36x_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2"
	xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
	<vendor>AnalogDevices</vendor>
	<name>ADuCM36x_DFP</name>
	<description>Analog Devices ADuCM36x Device Support and Examples</description>
	<url>http://download.analog.com/tools/EZBoards/CM36x/Releases/</url>
	<supportContact>http://www.analog.com/en/content/technical_support_page/fca.html</supportContact>
	<license>License/2017-12-08-CM36xCPF Click Thru SLA.txt</license>
	<releases>
		<release date="2019-05-12" version="1.0.4">
			Additional support for ADuCM362/3, improved support for IAR and bug fixes
    	</release>
		<release date="2018-06-25" version="1.0.3">
      		Additional support for ADuCM362/3 and bug fixes
    	</release>
		<release date="2017-12-11" version="1.0.2">
      		Compatible with CrossCore Embedded Studio
    	</release>
		<release version="1.0.1">
      		Fixed errors due to new ADI website
    	</release>
		<release version="1.0.0">
      		Initial Release
    	</release>
	</releases>
	<keywords>
		<!-- keywords for indexing -->
		<keyword>Analog Devices</keyword>
		<keyword>ADI</keyword>
		<keyword>Device Support</keyword>
		<keyword>Board Support</keyword>
		<keyword>Device Family Package Analog Devices</keyword>
		<keyword>ADuCM360</keyword>
		<keyword>ADuCM361</keyword>
		<keyword>ADuCM362</keyword>
		<keyword>ADuCM363</keyword>
	</keywords>
	<devices>
		<family Dfamily="ADuCM36x Series" Dvendor="Analog Devices:1">
			<processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="16000000"/>
			<book    name="Documents/DUI0552A_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
			<book    name="Documents/AN-1160.pdf"                 title="Cortex-M3 Based ADuCxxx Serial Download Protocol"/>
			<book    name="Documents/AN-1159.pdf"                 title="I2C-Compatible Interface"/>
			<book    name="Documents/AN-1111.pdf"                 title="Options for Minimizing Power Consumption When Using the ADuCM360/ADuCM361"/>
			<book    name="Documents/CN0221.pdf"                  title="USB-Based, Thermocouple Temperature Measurement System"/>
			<book    name="Documents/CN0267.pdf"                  title="Complete 4 mA to 20 mA Loop Powered Field Instrument with HART Interface"/>
			<book    name="Documents/CN0300.pdf"                  title="12-Bit, 4-20mA Loop-Powered Thermocouple Measurement System"/>
			<book    name="Documents/CN0319.pdf"                  title="14-Bit, 4-20 mA, Loop Powered, Thermocouple Temperature Measurement System"/>
			<feature type="AnalogOther"   n="2"       name="Programmable current source" />
			<feature type="AnalogOther"   n="1"       name="Precision voltage reference" />
			<feature type="AnalogOther"   n="1"       name="VBias Generator" />
			<feature type="AnalogOther"   n="1"       name="Ground Switch" />
			<feature type="AnalogOther"   n="1"       name="Diagnostic current sources" />
			<feature type="DAC"           n="1"       m="12"/>
			<feature type="PWM"           n="6"       m="16"/>
			<feature type="Memory"        n="8192"    name="8kB SRAM"/>
			<feature type="SPI"           n="2"       m="8000000"/>
			<feature type="I2C"           n="2"/>
			<feature type="UART"          n="1"       m="500000"/>
			<feature type="IOs"           n="19"/>
			<feature type="Timer"         n="2"       m="16"/>
			<feature type="WDT"           n="1"/>
			<feature type="TimerOther"    n="1"       name="32 bitWake-up timer"/>
			<feature type="DMA"           n="12"/>
			<feature type="NVIC"          n="39"/>
			<feature type="TempSens"      n="1"/>
			<feature type="Temp"          n="-40"     m="125"/>
			<feature type="VCC"           n="1.80"    m="3.60"/>
			<feature type="CSP"           n="48"/>
			<subFamily DsubFamily="ADuCM360_1">
				<feature type="Memory" n="131072" name="128kB Flash memory"/>
				<memory    id="IROM1"                    start="0x00000000" size="0x20000" startup="1" default="1"/>
				<memory    id="IRAM1"                    start="0x20000000" size="0x2000"  init ="1" default="1"/>
				<algorithm name="Flash/ADUCMxxx_128.FLM" start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>
				<book name="Documents/ADuCM360_361.pdf"                                 title="ADuCM360 Data Sheet"/>
				<book name="Documents/ADuCM360_361_silicon_anomaly.pdf"                 title="ADuCM360 Silicon Anomalies"/>
				<book name="Documents/UG-367.pdf"                                       title="ADuCM360 Hardware Reference Manual"/>
				<book name="Documents/ADuCM360_361_Digital_Filter_Response_Model.xlsx"  title="ADuCM360 Digital Filter Response Model"/>
				<book name="Documents/ADuCM360_361_IDD_calculator_RevD.xlsx"            title="ADuCM360 IDD calculator"/>
				<book name="Documents/UG-457.pdf"                                       title="ADuCM360 Users Guide"/>
				<!-- ****************************** ADuCM36x ****************************** -->
				<device Dname="ADuCM360">
					<description>
The ADuCM360 is a fully integrated, 3.9 kSPS, 24-bit data acquisition system that incorporates dual high performance, multichannel sigma-delta ADCs,a 32-bit ARM Cortex-M3 processor, and Flash/EE memory on a single chip.
The ADuCM360 is designed for direct interfacing to external precision sensors in both wired and battery-powered applications.
					</description>
					<feature type="ADC"           n="15"      m="24"    name="Ultra high precision, Multichannel, Dual 24-bit ADCs"/>
					<compile header="Device/Include/ADuCM360.h"  define="__ADUCM360__"/>
					<debug      svd="SVD/ADuCM360.svd"/>
				</device>
				<device Dname="ADuCM361">
					<description>
The ADuCM361 is a fully integrated, 3.9 kSPS, 24-bit data acquisition system incorporating high performance multi-channel sigma-delta ADC, 32-bit ARM Cortex-M3 MCU, and Flash/EE memory on a single chip.
The ADuCM361 is designed for direct interfacing to external precision sensors in both wired and battery-powered applications.
					</description>
					<feature type="ADC"           n="15"      m="24"    name="Ultra high precision, Multichannel, 24-bit ADC"/>
					<compile header="Device/Include/ADuCM361.h"  define="__ADUCM361__"/>
					<debug      svd="SVD/ADuCM361.svd"/>
				</device>
			</subFamily>
			<subFamily DsubFamily="ADuCM362_3">
				<feature type="Memory"  n="262144" name="256kB Flash memory"/>
				<memory    id="IROM1"                    start="0x00000000" size="0x20000" startup="1" default="1"/>
				<memory    id="IRAM1"                    start="0x20000000" size="0x6000"  init ="1" default="1"/>
				<algorithm name="Flash/ADUCMxxx_256.FLM" start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>
				<book name="Documents/ADuCM362_363.pdf"                                   title="ADuCM362 Data Sheet"/>
				<book name="Documents/ADuCM362_363_Hardware_Reference_Manual_UG_1048.pdf" title="ADuCM362 Hardware Reference Manual"/>
				<device Dname="ADuCM362">
					<description>
The ADuCM362 is a fully integrated, 3.9 kSPS, 24-bit data acquisition system incorporating high performance multi-channel sigma-delta ADC, 32-bit ARM Cortex-M3 MCU, and Flash/EE memory on a single chip.
The ADuCM362 is designed for direct interfacing to external precision sensors in both wired and battery-powered applications.
					</description>
					<feature type="ADC"           n="15"      m="24"    name="Ultra high precision, Multichannel, 24-bit ADC"/>
					<compile header="Device/Include/ADuCM362.h"  define="__ADUCM362__"/>
					<debug      svd="SVD/ADuCM362.svd"/>
				</device>
				<device Dname="ADuCM363">
					<description>
The ADuCM363 is a fully integrated, 3.9 kSPS, 24-bit data acquisition system incorporating high performance multi-channel sigma-delta ADC, 32-bit ARM Cortex-M3 MCU, and Flash/EE memory on a single chip.
The ADuCM363 is designed for direct interfacing to external precision sensors in both wired and battery-powered applications. The ADuCM363 contains all the features of the ADuCM362 except for the ADC0, which is removed.
					</description>
					<feature type="ADC"           n="15"      m="24"    name="Ultra high precision, Multichannel, 24-bit ADC"/>
					<compile header="Device/Include/ADuCM363.h"  define="__ADUCM363__"/>
					<debug      svd="SVD/ADuCM363.svd"/>
				</device>
			</subFamily>
		</family>
