glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM36x_DFP.pdsc
		<condition id="ADuCM361">
			<description>ADuCM361 device</description>
			<require Dvendor="Analog Devices:1"/>
			<require Dname="ADuCM361"/>
		</condition>
		<condition id="ADuCM361_ARM">
			<description>ADuCM361 device</description>
			<require condition="ADuCM361"/>
			<require Tcompiler="ARMCC"/>
		</condition>
		<condition id="ADuCM361_GCC">
			<description>ADuCM361 GCC</description>
			<require condition="ADuCM361"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM361_IAR">
			<description>ADuCM361 device</description>
			<require condition="ADuCM361"/>
			<require Tcompiler="IAR"/>
		</condition>
		<condition id="ADuCM362">
			<description>ADuCM362 device</description>
			<require Dvendor="Analog Devices:1"/>
			<require Dname="ADuCM362"/>
		</condition>
		<condition id="ADuCM362_ARM">
			<description>ADuCM362 device</description>
			<require condition="ADuCM362"/>
			<require Tcompiler="ARMCC"/>
		</condition>
		<condition id="ADuCM362_GCC">
			<description>ADuCM362 GCC</description>
			<require condition="ADuCM362"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM362_IAR">
			<description>ADuCM362 device</description>
			<require condition="ADuCM362"/>
			<require Tcompiler="IAR"/>
		</condition>
		<condition id="ADuCM363">
			<description>ADuCM363 device</description>
			<require Dvendor="Analog Devices:1"/>
			<require Dname="ADuCM363"/>
		</condition>
		<condition id="ADuCM363_ARM">
			<description>ADuCM363 device</description>
			<require condition="ADuCM363"/>
			<require Tcompiler="ARMCC"/>
		</condition>
		<condition id="ADuCM363_GCC">
			<description>ADuCM363 GCC</description>
			<require condition="ADuCM363"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM363_IAR">
			<description>ADuCM363 device</description>
			<require condition="ADuCM363"/>
			<require Tcompiler="IAR"/>
		</condition>
		<condition id="ADuCM36x">
			<description>ADuCM36x device</description>
			<accept  condition="ADuCM360"/>
			<accept  condition="ADuCM361"/>
			<accept  condition="ADuCM362"/>
			<accept  condition="ADuCM363"/>
		</condition>
		<condition id="ADuCM36x_ARM">
			<description>ADuCM36x ARMCC</description>
			<accept  condition="ADuCM360"/>
			<accept  condition="ADuCM361"/>
			<accept  condition="ADuCM362"/>
			<accept  condition="ADuCM363"/>
			<require condition="ARMCC"/>
		</condition>
		<condition id="ADuCM36x_GCC">
			<description>ADuCM36x GCC</description>
			<accept  condition="ADuCM360"/>
			<accept  condition="ADuCM361"/>
			<accept  condition="ADuCM362"/>
			<accept  condition="ADuCM363"/>
			<require condition="GCC"/>
		</condition>
		<condition id="ADuCM36x_IAR">
			<description>ADuCM36x IAR</description>
			<accept  condition="ADuCM360"/>
			<accept  condition="ADuCM361"/>
			<accept  condition="ADuCM362"/>
			<accept  condition="ADuCM363"/>
			<require condition="IAR"/>
		</condition>
		<condition id="ADuCM36x CMSIS Device">
			<description>ADuCM36x CMSIS Device</description>
			<require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
			<require Dvendor="Analog Devices:1"/>
			<accept  condition="ADuCM360"/>
			<accept  condition="ADuCM361"/>
			<accept  condition="ADuCM362"/>
			<accept  condition="ADuCM363"/>
		</condition>
		<!-- Driver Requirements -->
		<condition id="ADuCM36x Driver">
			<description>Common ADuCM36x driver requirements</description>
			<require condition="ADuCM36x CMSIS Device"/>
			<require Cclass="CMSIS" Cgroup="CORE"/>
			<!-- <require Cclass="Device" Cgroup="Global Configuration"/> -->
		</condition>
		<!-- Drivers Dependency -->
		<condition id="ADuCM36x ADC">
			<description>ADuCM36x ADC driver requirements</description>
			<require condition="ADuCM36x Driver"/>
			<require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
			<!-- <require Cclass="Device" Cgroup="Drivers" Csub="Power"/> -->
		</condition>
		<condition id="ADuCM36x URT">
			<description>ADuCM36x UART driver requirements</description>
			<require condition="ADuCM36x Driver"/>
			<require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
			<!-- <require Cclass="Device" Cgroup="Drivers" Csub="Power"/> -->
		</condition>
	</conditions>
	<taxonomy>
		<description Cclass="Device" Cgroup="Drivers" doc="Docs/html/index.html">Analog Devices driver components for ADuCM36x devices</description>
	</taxonomy>
	<components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="ADuCM36x CMSIS Device">
			<!-- Cversion is necessary -->
			<description>System Startup for ADuCM36x</description>
			<files>
				<!-- additional include path -->
				<file category="include" name="Device/Include/"/>
				<!-- startup files for ARMCC-->
				<file category="source" name="Device/Source/ARM/startup_ADuCM360.s" version="1.0.0" attr="config" condition="ADuCM360_ARM"/>
				<file category="source" name="Device/Source/ARM/startup_ADuCM361.s" version="1.0.0" attr="config" condition="ADuCM361_ARM"/>
				<file category="source" name="Device/Source/ARM/startup_ADuCM362.s" version="1.0.0" attr="config" condition="ADuCM362_ARM"/>
				<file category="source" name="Device/Source/ARM/startup_ADuCM363.s" version="1.0.0" attr="config" condition="ADuCM363_ARM"/>
				<!-- startup files for GCC-->
				<file category="source" name="Device/Source/GCC/startup_ADuCM360.c" version="1.0.4" attr="config" condition="ADuCM360_GCC"/>
				<file category="source" name="Device/Source/GCC/startup_ADuCM361.c" version="1.0.4" attr="config" condition="ADuCM361_GCC"/>
				<file category="source" name="Device/Source/GCC/startup_ADuCM362.c" version="1.0.4" attr="config" condition="ADuCM362_GCC"/>
				<file category="source" name="Device/Source/GCC/startup_ADuCM363.c" version="1.0.4" attr="config" condition="ADuCM363_GCC"/>
				<!-- startup files for IAR-->
				<file category="source" name="Device/Source/IAR/startup_ADuCM360.s" version="1.0.4" attr="config" condition="ADuCM360_IAR"/>
				<file category="source" name="Device/Source/IAR/startup_ADuCM361.s" version="1.0.4" attr="config" condition="ADuCM361_IAR"/>
				<file category="source" name="Device/Source/IAR/startup_ADuCM362.s" version="1.0.4" attr="config" condition="ADuCM362_IAR"/>
				<file category="source" name="Device/Source/IAR/startup_ADuCM363.s" version="1.0.4" attr="config" condition="ADuCM363_IAR"/>
				<!-- system files -->
				<file category="source" name="Device/Source/system_ADuCM360.c" version="1.0.4" attr="config"      condition="ADuCM360" />
				<file category="source" name="Device/Source/system_ADuCM361.c" version="1.0.4" attr="config"      condition="ADuCM361" />
				<file category="source" name="Device/Source/system_ADuCM362.c" version="1.0.4" attr="config"      condition="ADuCM362" />
				<file category="source" name="Device/Source/system_ADuCM363.c" version="1.0.4" attr="config"      condition="ADuCM363" />
				<!-- linker scripts -->
				<file category="linkerScript" name="Device/Source/GCC/ADuCM360.ld" version="1.0.4" attr="config" condition="ADuCM360_GCC"/>
				<file category="linkerScript" name="Device/Source/GCC/ADuCM361.ld" version="1.0.4" attr="config" condition="ADuCM361_GCC"/>
				<file category="linkerScript" name="Device/Source/GCC/ADuCM362.ld" version="1.0.4" attr="config" condition="ADuCM362_GCC"/>
				<file category="linkerScript" name="Device/Source/GCC/ADuCM363.ld" version="1.0.4" attr="config" condition="ADuCM363_GCC"/>
			</files>
		</component>
		<!-- Drivers -->
		<component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.4" condition="ADuCM36x ADC">
			<description>ADC peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/AdcLib.c"/>
				<file category="header" name="Device/Include/drivers/AdcLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__adc.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="DMA" Cversion="1.0.4" condition="ADuCM36x">
			<description>DMA peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/DmaLib.c"/>
				<file category="header" name="Device/Include/drivers/DmaLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__dma.html"/>
			</files>
		</component>
