glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM36x_DFP.pdsc
		<component Cclass="Device" Cgroup="Drivers" Csub="DIO" Cversion="1.0.4" condition="ADuCM36x">
			<description>Digital IO peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/DioLib.c"/>
				<file category="header" name="Device/Include/drivers/DioLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__dio.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="GPT" Cversion="1.0.4" condition="ADuCM36x">
			<description>Timer peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/GptLib.c"/>
				<file category="header" name="Device/Include/drivers/GptLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__gpt.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="DAC" Cversion="1.0.4" condition="ADuCM36x">
			<description>DAC peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/DacLib.c"/>
				<file category="header" name="Device/Include/drivers/DacLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__dac.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="FEE" Cversion="1.0.4" condition="ADuCM36x">
			<description>Flash peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/FeeLib.c"/>
				<file category="header" name="Device/Include/drivers/FeeLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__fee.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="CLK" Cversion="1.0.4" condition="ADuCM36x">
			<description>Clock System functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/ClkLib.c"/>
				<file category="header" name="Device/Include/drivers/ClkLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__clk.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.4" condition="ADuCM36x">
			<description>I2C peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/I2cLib.c"/>
				<file category="header" name="Device/Include/drivers/I2cLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__i2c.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="IEXC" Cversion="1.0.4" condition="ADuCM36x">
			<description>Excitation Current Source functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/IexcLib.c"/>
				<file category="header" name="Device/Include/drivers/IexcLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__iexc.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="INT" Cversion="1.0.4" condition="ADuCM36x">
			<description>Interrupt functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/IntLib.c"/>
				<file category="header" name="Device/Include/drivers/IntLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__int.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="PWM" Cversion="1.0.4" condition="ADuCM36x">
			<description>PWM functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/PwmLib.c"/>
				<file category="header" name="Device/Include/drivers/PwmLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__pwm.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.4" condition="ADuCM36x">
			<description>Functions for controling power modes</description>
			<files>
				<file category="source" name="Device/Source/drivers/PwrLib.c"/>
				<file category="header" name="Device/Include/drivers/PwrLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__pwr.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="RST" Cversion="1.0.4" condition="ADuCM36x">
			<description>Reads the reset status bits and allows them to be reset</description>
			<files>
				<file category="source" name="Device/Source/drivers/RstLib.c"/>
				<file category="header" name="Device/Include/drivers/RstLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__rst.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.4" condition="ADuCM36x">
			<description>SPI peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/SpiLib.c"/>
				<file category="header" name="Device/Include/drivers/SpiLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__spi.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="URT" Cversion="1.0.4" condition="ADuCM36x URT">
			<description>UART peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/UrtLib.c"/>
				<file category="header" name="Device/Include/drivers/UrtLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__urt.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.4" condition="ADuCM36x">
			<description>Watchdog Timer peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/WdtLib.c"/>
				<file category="header" name="Device/Include/drivers/WdtLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__wdt.html"/>
			</files>
		</component>
		<component Cclass="Device" Cgroup="Drivers" Csub="WUT" Cversion="1.0.4" condition="ADuCM36x">
			<description>Wake up Timer peripheral functions</description>
			<files>
				<file category="source" name="Device/Source/drivers/WutLib.c"/>
				<file category="header" name="Device/Include/drivers/WutLib.h" version="1.0.4" attr="config"/>
				<file category="doc" name="Docs/html/group__wut.html"/>
			</files>
		</component>
	</components>
</package>
